sl_log_file       = "/private/var/touchelf/scripts/sl/sl_log.txt" --配置文件
sl_error_time     = 3 ;  --容错处理
try_time  =   1     --等待时间/s
strategy = {"1"}    ;     --策略 =1 -- 2  

action = {         --功能
     --微信通讯录：2
     "搜索手机加好友" , --2.11  --添加朋友 
     "加公众号"   ,     --2.12
     "通讯录加好友" ,   --2.2
     "微信群加好友",    --2.3
     "转发说说 文章"  ,    --2.4
     "转发公众号文章" ,  --2.5
     "随机发消息",      --2.6
     --微信发现  3
     "附近人打招呼"  ,  --3.1
     "漂流瓶"     ,     --3.2  
     "发朋友圈"    ,    --3.3
     "保存图片到相册发朋友圈" , --3.31
     "站街扫街"    ,    --3.4
     --我  4
     "修改名字签名头像",  --4.1
     "清理缓存"      ,  --4.2
     "群发消息"      ,  --4.3
     --手机 5
     "删除照片"     ,  --5.1
     "增加联系人"    , --5.2
     "删除联系人"     --5.3
}


gongneng = 2.7 ;       --1=action[1]...
--全局配置参数
